#+TITLE: January 21, 2019 - February 5, 2019 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2019-01-21 Mon>
  :wpd-bhavin192: 0.5
  :wpd-jasonbraganza: 5
  :wpd-nightwarrior-xxx: 1.2
  :wpd-sandeepk: 1.5
  :wpd-vaibhavk: 1.5
  :END:
** bhavin192
*** Learning Golang
**** Chapter 11. Testing [0/6]
     :PROPERTIES:
     :ESTIMATED: 2.5
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       READ.1547130354
     :TASKID:   READ.1547130354
     :END:
     - [ ] 11.1 The go test Tool    (10m)
     - [ ] 11.2 Test Functions      (1.7h)
     - [ ] 11.3 Coverage            (20m)
     - [ ] 11.4 Benchmark Functions (20m)
     - [ ] 11.5 Profiling           (25m)
     - [ ] 11.6 Example Functions   (5m)
**** Chapter 11 Exercises [0/2]
     :PROPERTIES:
     :ESTIMATED: 3.35
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       DEV.1547130395
     :TASKID:   DEV.1547130395
     :END:
     - [ ] 11.2 (3h)
     - [ ] 11.4 (1.25h)
*** GNU Emacs bug triaging [0/2]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       OPS.1545721236
    :TASKID:   OPS.1545721236
    :END:
    - [ ] Build GNU Emacs 26.1 from source code
    - [ ] Triage 5 bugs
      - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33983][#33983]]: c++-mode syntax highlighting after some symbols
      - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33979][#33979]]: python.el is not fully PEP 8 compliant for closing parens
      - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33973][#33973]]: Multi-line C++ raw string literal font lock is broken
      - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33921][#33921]]: Default height is inconsistently - and apparently
        also incorrectly - documented
      - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33900][#33900]]: GNUmakefile mode colors fooled by colons in shell commands
** jasonbraganza
*** NIOS Maths Text Book [0/10]
    :PROPERTIES:
    :ESTIMATED: 50.0
    :ACTUAL:
    :OWNER: shaks
    :ID: READ.1548140097
    :TASKID: READ.1548140097
    :END:
    - [ ] Module - I [0/5]
      - [ ] 2019-01-19 - 1 - Sets
      - [ ] 2019-01-20 - 2 - Relations and Functions
      - [ ] 2019-01-21 - 3 - Trigonometric Functions I
      - [ ] 2019-01-22 - 4 - Trigonometric Functions II
      - [ ] 2019-01-25 - 5 - Relation between Sides and Angles of a Triangle
    - [ ] Module - II: Sequences and series [0/2]
      - [ ] 2019-01-26 - 6 - Sequences and series
      - [ ] 2019-01-27 - 7 - Some special sequences
    - [ ] Module - III: Algebra–I [0/5]
      - [ ] 2019-01-28 - 8 - Complex Numbers
      - [ ] 2019-01-29 - 9 - Quadratic Equations and Linear Inequalities
      - [ ] 2019-02-01 - 10 - Principle of Mathematical Induction
      - [ ] 2019-02-02 - 11 -  Permtations and Combinations
      - [ ] 2019-02-03 - 12 - Binomial Theorem
    - [ ] Module - IV: Co-ordinate Geometry [0/4]
      - [ ] 2019-02-09 - 13 - Cartesian System of Rectangular Co-ordinates
      - [ ] 2019-02-10 - 14 - Straight Lines
      - [ ] 2019-02-11 - 15 - Circles
      - [ ] 2019-02-12 - 16 - Conic Sections
    - [ ] Module - V: Statistics and Probability [0/3]
      - [ ] 2019-02-15 - 17 - Measures of Dispersion
      - [ ] 2019-02-16 - 18 - Random Experiments and Events
      - [ ] 2019-02-17 - 19 - Probability
    - [ ] Module - VI: Algebra–II [0/3]
      - [ ] 2019-02-18 - 20 - Matrices
      - [ ] 2019-02-19 - 21 - Determinants
      - [ ] 2019-02-22 - 22 - Inverse of a Matrix and its Applications
    - [ ] Module - VII: Relations and Functions [0/2]
      - [ ] 2019-02-23 - 23 - Relations and Functions II
      - [ ] 2019-02-24 - 24 - Inverse Trigonometric Functions
    - [ ] Module - VIII: Calculus [0/8]
      - [ ] 2019-02-25 - 25 -  Limits and Continuity
      - [ ] 2019-02-26 - 26 - Differentiation
      - [ ] 2019-03-01 - 27 - Differentiation of Trigonometric Functions
      - [ ] 2019-03-02 - 28 - Differentiation of Exponential and Logarithmic functions
      - [ ] 2019-03-03 - 29 - Application of Derivatives
      - [ ] 2019-03-04 - 30 - Integration
      - [ ] 2019-03-05 - 31 - Definite Integrals
      - [ ] 2019-03-08 - 32 - Differential Integrals
    - [ ] Module - IX: Vectors and Three Dimensional Geometry [0/4]
      - [ ] 2019-03-09 - 33 - Introduction to Three Dimensional Geometry
      - [ ] 2019-03-10 - 34 - Vectors
      - [ ] 2019-03-11 - 35 - Plane
      - [ ] 2019-03-12 - 36 - Straight Line
    - [ ] Module - X: Linear Programming and Mathematical Reasoning [0/2]
      - [ ] 2019-03-15 - 37 - Linear Programming
      - [ ] 2019-03-16 - 38 - Mathematical Reasoning
** nightwarrior-xxx
*** [#A] Learning Node [0/7]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: DEV.1548227691
    :TASKID: DEV.1548227691
    :END:
    - [ ] Node.js
    - [ ] Npm
    - [ ] Asynchronous programming
    - [ ] ES6/ES7
    - [ ] MongoDB
    - [ ] Express
    - [ ] Socket.IO
*** [#A] Blog
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: WRITE.1548227615
    :TASKID: WRITE.1548227615
    :END:
*** [#B] Cracking the HackerEarth [0/3]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: WRITE.1548227737
    :TASKID: WRITE.1548227737
    :END:
    - [ ] Segment Trees Problems
    - [ ] Interval Trees Problems
    - [ ] RB Trees Problems
*** [#B] Advance Shell Scripting By TLDP [0/19]  
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: nightwarrior-xxx
    :ID: READ.1539458077
    :TASKID: READ.1539458077
    :END:
    [[http://tldp.org/LDP/abs/html/]]
    - [ ] cleanup: A script to clean up log files in /var/log
    - [ ] cleanup: An improved clean-up script
    - [ ] leanup: An enhanced and generalized version of above scripts.
    - [ ] Code blocks and I/O redirection
    - [ ] Saving the output of a code block to a file
    - [ ] Running a loop in the background
    - [ ] Backup of all files changed in last day
    - [ ] Variable assignment and substitution
    - [ ] Plain Variable Assignment
    - [ ] Variable Assignment, plain and fancy
    - [ ] Integer or string?
    - [ ] Positional Parameters
    - [ ] whois domain name lookup
    - [ ] Using shift
    - [ ] Echoing Weird Variables
    - [ ] Escaped Characters
    - [ ] Detecting key-presses
    - [ ] Processes
    - [ ] Threading
** sandeepk
*** TODO [[https://www.coursera.org/learn/learning-how-to-learn/][Learning How to Learn]] [1/2]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   4.58
    :OWNER:    sandeepk
    :ID:       READ.1548088815
    :TASKID:   READ.1548088815
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-31 Thu 20:15]--[2019-01-31 Thu 21:35] =>  1:20
    CLOCK: [2019-01-29 Tue 20:55]--[2019-01-29 Tue 22:00] =>  1:05
    CLOCK: [2019-01-28 Mon 21:20]--[2019-01-28 Mon 22:25] =>  1:05
    CLOCK: [2019-01-26 Sat 13:55]--[2019-01-26 Sat 14:30] =>  0:35
    CLOCK: [2019-01-26 Sat 13:00]--[2019-01-26 Sat 13:30] =>  0:30
    :END:
    - [X] Procrastination and Memory (5h)
    - [ ] Renaissance Learning and Unlocking Your Potential (4h)
*** TODO Project Hacker News [2/3]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:   8.33
    :OWNER:    sandeepk
    :ID:       DEV.1548171355
    :TASKID:   DEV.1548171355
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-03 Sun 16:00]--[2019-02-03 Sun 17:00] =>  1:00
    CLOCK: [2019-02-02 Sat 20:00]--[2019-02-02 Sat 21:00] =>  1:00
    CLOCK: [2019-01-30 Wed 21:00]--[2019-01-30 Wed 22:00] =>  1:00
    CLOCK: [2019-01-30 Wed 14:00]--[2019-01-30 Wed 14:40] =>  0:40
    CLOCK: [2019-01-27 Sun 17:00]--[2019-01-27 Sun 18:00] =>  1:00
    CLOCK: [2019-01-27 Sun 14:00]--[2019-01-27 Sun 14:35] =>  0:35
    CLOCK: [2019-01-26 Sat 21:00]--[2019-01-26 Sat 21:30] =>  0:30
    CLOCK: [2019-01-26 Sat 19:00]--[2019-01-26 Sat 19:40] =>  0:40
    CLOCK: [2019-01-21 Mon 23:00]--[2019-01-22 Tue 00:00] =>  1:00
    CLOCK: [2019-01-21 Mon 21:35]--[2019-01-21 Mon 22:30] =>  0:55
    :END:
    - [X] Features Break Down (3h)
    - [X] Env SetUp (6h)
    - [ ] Model Layout (6h)
** vaibhavk
*** Computer Network by Kruose & Ross [0/1]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: vaibhavk
    :ID: READ.1548224363
    :TASKID: READ.1548224363
    :END:
    - [ ] Chapter 6. Wireless and Mobile Network
*** Kubernetes Tutorial [0/6]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER: vaibhavk
    :ID: DEV.1548225186
    :TASKID: DEV.1548225186
    :END:
    - [ ] [[https://kubernetes.io/docs/tutorials/kubernetes-basics/create-cluster/cluster-intro/][Create a Cluster]] (1h)
    - [ ] [[https://kubernetes.io/docs/tutorials/kubernetes-basics/deploy-app/deploy-intro/][Using kubectl to Create a Deployment]] (1h 30m)
    - [ ] [[https://kubernetes.io/docs/tutorials/kubernetes-basics/explore/explore-intro/][Viewing Pods and Nodes]] (2h)
    - [ ] [[https://kubernetes.io/docs/tutorials/kubernetes-basics/expose/expose-intro/][Using a Service to Expose Your App]] (2h)
    - [ ] [[https://kubernetes.io/docs/tutorials/kubernetes-basics/scale/scale-intro/][Running Multiple Instances of Your App]] (2h)
    - [ ] [[https://kubernetes.io/docs/tutorials/kubernetes-basics/update/update-intro/][Performing a Rolling Update]] (1h 30m)
*** TaskCluster
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:
    :OWNER: vaibhavk
    :ID: DEV.1548225960
    :TASKID: DEV.1548225960
    :END:
**** [[https://bugzilla.mozilla.org/show_bug.cgi?id=1517015][Issue 1517015]]
